Revit 2024 API
SolidCurveIntersection.GetCurveSegment Method
 Gets the curve segment generated by intersection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public Curve GetCurveSegment(
	int index
)
Visual Basic
Public Function GetCurveSegment ( _
	index As Integer _
) As Curve
Visual C++
public:
Curve^ GetCurveSegment(
	int index
)
Parameters
index
Type: System.Int32
 The index.
Return Value
 The curve.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  index is out of range.
See Also
SolidCurveIntersection Class
Autodesk.Revit.DB Namespace